rammp-org/pace-racer-fw/components/pace-racer-board/sensorless/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_FREERTOS_HZ=1000

CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144

CONFIG_SPI_MASTER_IN_IRAM=y
CONFIG_MCPWM_CTRL_FUNC_IN_IRAM=y

# Puts the adc_oneshot HAL in IRAM. The sampler runs it from the MCPWM timer ISR
# once per PWM period, and the sample has to land inside a null window only a few
# microseconds wide — a flash cache miss on that path is jitter we can't afford.
CONFIG_ADC_ONESHOT_CTRL_FUNC_IN_IRAM=y

# NOT ISR-IRAM-safe, unlike current-control: the sampling ISR's overcurrent trip
# calls espp's BldcDriver::set_pwm(), which is a flash-resident header inline.
# Safe because nothing writes flash while the motor is spinning (an IRAM-safe
# ISR only matters while the cache is disabled); if that ever changes, this and
# the trip path both have to be revisited.
CONFIG_MCPWM_ISR_IRAM_SAFE=n

# Make the native USB (USB-Serial-JTAG) port the primary console so it is
# bidirectional: the TUI can write commands to firmware stdin, not just read
# output. Default config binds stdin to UART0, which isn't on the USB port.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
